app/views/users/show.html.erb

    <div class="span8">
    <% if @user.shares.any? %>
---
SELECT "shares".* FROM "shares" WHERE "shares"."user_id" = ?  [["user_id", 3]]
SELECT 1 AS one FROM "shares" WHERE "shares"."user_id" = ? LIMIT 1  [["user_id", 3]]

          <% @user.shares.each do |t|%>
          <% receiver = User.find(t.receiver_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

      </ol>
      <h3>Shared (<%= Share.where(:receiver_id => @user.id).count %>) times</h3>
---
SELECT "shares".* FROM "shares" WHERE "shares"."receiver_id" = 3