app/views/shared/_stats.html.erb

SELECT COUNT(*) FROM "shares" WHERE "shares"."user_id" = ?  [["user_id", 3]]
---
    <strong id="following" class="stat">
      <%= @user.shares.count %>

SELECT COUNT(*) FROM "shares" WHERE "shares"."receiver_id" = 3
---
    <strong id="followers" class="stat">
      <%= Share.where(:receiver_id => @user.id).count %>